; domain
(define (domain imv-assigned)
  (:requirements :strips :typing)
  (:types location artifact robot slot)
  (:predicates
    (at ?r - robot ?l - location)
    (artifact_at ?a - artifact ?l - location)
    (slot_free ?r - robot ?s - slot)
    (in_slot ?a - artifact ?r - robot ?s - slot)
    (robot_slot ?r - robot ?s - slot)
    (handles ?r - robot ?a - artifact)
    (connected ?from ?to - location)
  )
  (:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and (at ?r ?from) (connected ?from ?to))
    :effect (and (not (at ?r ?from)) (at ?r ?to))
  )
  (:action load
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (at ?r ?l) (artifact_at ?a ?l) (slot_free ?r ?s) (robot_slot ?r ?s) (handles ?r ?a))
    :effect (and (not (slot_free ?r ?s)) (in_slot ?a ?r ?s) (not (artifact_at ?a ?l)))
  )
  (:action unload
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (at ?r ?l) (in_slot ?a ?r ?s) (handles ?r ?a))
    :effect (and (slot_free ?r ?s) (not (in_slot ?a ?r ?s)) (artifact_at ?a ?l))
  )
)

; problem
(define (problem imv-p02-curator-drone-assigned)
  (:domain imv-assigned)
  (:objects
    entrance tunnel hallA hallB cryo pod1 pod2 stasis - location
    a1 a2 b1 b2 cs1 cs2 - artifact
    r1 d1 - robot
    slot1 slot2 slot_d - slot
  )
  (:init
    (at r1 entrance)
    (at d1 entrance)
    (robot_slot r1 slot1)
    (robot_slot r1 slot2)
    (robot_slot d1 slot_d)
    (slot_free r1 slot1)
    (slot_free r1 slot2)
    (slot_free d1 slot_d)

    (handles r1 a1)
    (handles r1 a2)
    (handles r1 b1)
    (handles r1 b2)
    (handles d1 cs1)
    (handles d1 cs2)

    (artifact_at a1 hallA)
    (artifact_at a2 hallA)
    (artifact_at b1 hallB)
    (artifact_at b2 hallB)
    (artifact_at cs1 cryo)
    (artifact_at cs2 cryo)

    (connected entrance tunnel)
    (connected tunnel entrance)
    (connected tunnel cryo)
    (connected cryo tunnel)
    (connected tunnel pod1)
    (connected pod1 tunnel)
    (connected tunnel pod2)
    (connected pod2 tunnel)
    (connected tunnel hallA)
    (connected hallA tunnel)
    (connected tunnel hallB)
    (connected hallB tunnel)
    (connected tunnel stasis)
    (connected stasis tunnel)
  )
  (:goal (and
    (artifact_at a1 cryo)
    (artifact_at a2 cryo)
    (artifact_at b1 pod1)
    (artifact_at b2 pod2)
    (artifact_at cs1 stasis)
    (artifact_at cs2 stasis)
  ))
)

; plan
1. (move r1 entrance tunnel)
   deleted: (at r1 entrance)
   added: (at r1 tunnel)
   goals met: 0 of 6
2. (move d1 entrance tunnel)
   deleted: (at d1 entrance)
   added: (at d1 tunnel)
   goals met: 0 of 6
3. (move r1 tunnel halla)
   deleted: (at r1 tunnel)
   added: (at r1 halla)
   goals met: 0 of 6
4. (load r1 a1 halla slot1)
   deleted: (slot_free r1 slot1) (artifact_at a1 halla)
   added: (in_slot a1 r1 slot1)
   goals met: 0 of 6
5. (load r1 a2 halla slot2)
   deleted: (slot_free r1 slot2) (artifact_at a2 halla)
   added: (in_slot a2 r1 slot2)
   goals met: 0 of 6
6. (move r1 halla tunnel)
   deleted: (at r1 halla)
   added: (at r1 tunnel)
   goals met: 0 of 6
7. (move r1 tunnel cryo)
   deleted: (at r1 tunnel)
   added: (at r1 cryo)
   goals met: 0 of 6
8. (unload r1 a1 cryo slot1)
   deleted: (in_slot a1 r1 slot1)
   added: (slot_free r1 slot1) (artifact_at a1 cryo)
   goals met: 1 of 6
9. (unload r1 a2 cryo slot2)
   deleted: (in_slot a2 r1 slot2)
   added: (slot_free r1 slot2) (artifact_at a2 cryo)
   goals met: 2 of 6
10. (move r1 cryo tunnel)
   deleted: (at r1 cryo)
   added: (at r1 tunnel)
   goals met: 2 of 6
11. (move r1 tunnel hallb)
   deleted: (at r1 tunnel)
   added: (at r1 hallb)
   goals met: 2 of 6
12. (load r1 b1 hallb slot1)
   deleted: (slot_free r1 slot1) (artifact_at b1 hallb)
   added: (in_slot b1 r1 slot1)
   goals met: 2 of 6
13. (load r1 b2 hallb slot2)
   deleted: (slot_free r1 slot2) (artifact_at b2 hallb)
   added: (in_slot b2 r1 slot2)
   goals met: 2 of 6
14. (move r1 hallb tunnel)
   deleted: (at r1 hallb)
   added: (at r1 tunnel)
   goals met: 2 of 6
15. (move r1 tunnel pod1)
   deleted: (at r1 tunnel)
   added: (at r1 pod1)
   goals met: 2 of 6
16. (unload r1 b1 pod1 slot1)
   deleted: (in_slot b1 r1 slot1)
   added: (slot_free r1 slot1) (artifact_at b1 pod1)
   goals met: 3 of 6
17. (move r1 pod1 tunnel)
   deleted: (at r1 pod1)
   added: (at r1 tunnel)
   goals met: 3 of 6
18. (move r1 tunnel pod2)
   deleted: (at r1 tunnel)
   added: (at r1 pod2)
   goals met: 3 of 6
19. (unload r1 b2 pod2 slot2)
   deleted: (in_slot b2 r1 slot2)
   added: (slot_free r1 slot2) (artifact_at b2 pod2)
   goals met: 4 of 6
20. (move d1 tunnel cryo)
   deleted: (at d1 tunnel)
   added: (at d1 cryo)
   goals met: 4 of 6
21. (load d1 cs1 cryo slot_d)
   deleted: (slot_free d1 slot_d) (artifact_at cs1 cryo)
   added: (in_slot cs1 d1 slot_d)
   goals met: 4 of 6
22. (move d1 cryo tunnel)
   deleted: (at d1 cryo)
   added: (at d1 tunnel)
   goals met: 4 of 6
23. (move d1 tunnel stasis)
   deleted: (at d1 tunnel)
   added: (at d1 stasis)
   goals met: 4 of 6
24. (unload d1 cs1 stasis slot_d)
   deleted: (in_slot cs1 d1 slot_d)
   added: (slot_free d1 slot_d) (artifact_at cs1 stasis)
   goals met: 5 of 6
25. (move d1 stasis tunnel)
   deleted: (at d1 stasis)
   added: (at d1 tunnel)
   goals met: 5 of 6
26. (move d1 tunnel cryo)
   deleted: (at d1 tunnel)
   added: (at d1 cryo)
   goals met: 5 of 6
27. (load d1 cs2 cryo slot_d)
   deleted: (slot_free d1 slot_d) (artifact_at cs2 cryo)
   added: (in_slot cs2 d1 slot_d)
   goals met: 5 of 6
28. (move d1 cryo tunnel)
   deleted: (at d1 cryo)
   added: (at d1 tunnel)
   goals met: 5 of 6
29. (move d1 tunnel stasis)
   deleted: (at d1 tunnel)
   added: (at d1 stasis)
   goals met: 5 of 6
30. (unload d1 cs2 stasis slot_d)
   deleted: (in_slot cs2 d1 slot_d)
   added: (slot_free d1 slot_d) (artifact_at cs2 stasis)
   goals met: 6 of 6
